# Código de inicialización
Este código permite inicializar las bibliotecas para usar SQLite en la máquina virtual de Google Colab. El código además elimina cualquier dato almacenado anteriormente en el archvio `ejemplos.db`. Es recomendable volver a correr el código cada vez que se comience con la resolución de un nuevo ejercicio.

In [1]:
!pip install pymysql
%load_ext sql
!rm -rf ejemplos.db
%sql sqlite:///ejemplos.db

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 45.0/45.0 kB 3.1 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

# EJERCICIOS DE GROUP y HAVING

## Ejercicio 1: Ventas por Ciudad de distintos insumos informáticos

Tienes dos tablas llamadas `Ventas` y `Productos`:

- La tabla `Ventas` tiene las siguientes columnas:
  - `VentaID` (INT)
  - `ProductoID` (INT, FOREIGN KEY que referencia a `Productos(ProductoID)`)
  - `CantidadVendida` (INT)
  - `PrecioUnitario` (DECIMAL)
  - `Ciudad` (VARCHAR)

- La tabla `Productos` tiene las siguientes columnas:
  - `ProductoID` (INT, PRIMARY KEY)
  - `NombreProducto` (VARCHAR)
  - `Precio` (DECIMAL)

Deseas analizar las ventas por ciudad, combinando la información de ambas tablas para mostrar el nombre de los productos vendidos y el total de ingresos generados por cada ciudad.

In [2]:
%%sql
-- Escribe aquí el código DDL para crear las tablas Ventas y Productos
create table Ventas(
  VentaID INT,
  ProductoID INT,
  CantidadVendida INT,
  PrecioUnitario DECIMAL,
  Ciudad VARCHAR,
  FOREIGN KEY (ProductoID) REFERENCES Productos(ProductoID)
);

create table Productos(
  ProductoID INT PRIMARY KEY,
  NombreProducto VARCHAR,
  Precio DECIMAL
);

 * sqlite:///ejemplos.db
Done.
Done.

[]

**Rellenado de la tabla Ventas**

In [3]:
# Población de la tabla Ventas
# Insertar datos en la tabla Ventas
%%sql
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES
(5, 1, 6, 45.00, 'Buenos Aires'),
(6, 12, 9, 35.00, 'Córdoba'),
(7, 2, 4, 20.00, 'Rosario'),
(8, 13, 12, 60.00, 'Mendoza'),
(9, 3, 7, 55.00, 'La Plata'),
(10, 3, 5, 32.50, 'San Miguel de Tucumán'),
(11, 11, 3, 28.00, 'Salta'),
(12, 11, 8, 40.00, 'Mar del Plata'),
(13, 11, 11, 70.00, 'Santa Fe'),
(14, 11, 4, 25.00, 'San Juan'),
(15, 11, 9, 35.00, 'Neuquén'),
(16, 11, 6, 45.00, 'Posadas'),
(17, 13, 10, 50.00, 'Bahía Blanca'),
(18, 11, 12, 65.00, 'San Salvador de Jujuy'),
(19, 15, 3, 22.50, 'Comodoro Rivadavia');

INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES
(1, 'Teclado Mecánico', 75.00),
(2, 'Mouse Inalámbrico', 45.00),
(3, 'Monitor 24 Pulgadas', 150.00),
(4, 'Disco Duro SSD 1TB', 120.00),
(5, 'Memoria RAM 16GB', 80.00),
(6, 'Placa Madre ATX', 200.00),
(7, 'Tarjeta Gráfica 6GB', 350.00),
(8, 'Auriculares con Micrófono', 60.00),
(9, 'Cámara Web HD', 55.00),
(10, 'Micrófono de Condensador', 90.00),
(11, 'Router WiFi 6', 130.00),
(12, 'Impresora Láser', 180.00),
(13, 'Soporte Monitor Ajustable', 25.00),
(14, 'Teclado Inalámbrico', 50.00),
(15, 'Mouse Gaming', 40.00);

 * sqlite:///ejemplos.db
15 rows affected.
15 rows affected.

[]

**Consignas del ejercicio:**

1. Encuentre el total de ingresos (`CantidadVendida * PrecioUnitario`) por cada ciudad.

In [4]:
%%sql
SELECT Ciudad, CantidadVendida * PrecioUnitario AS TotalIngresos
FROM Ventas
GROUP BY Ciudad;

 * sqlite:///ejemplos.db
Done.

[('Bahía Blanca', 500),
 ('Buenos Aires', 270),
 ('Comodoro Rivadavia', 67.5),
 ('Córdoba', 315),
 ('La Plata', 385),
 ('Mar del Plata', 320),
 ('Mendoza', 720),
 ('Neuquén', 315),
 ('Posadas', 270),
 ('Rosario', 80),
 ('Salta', 84),
 ('San Juan', 100),
 ('San Miguel de Tucumán', 162.5),
 ('San Salvador de Jujuy', 780),
 ('Santa Fe', 770)]

2. Escriba el código SQL para listar las Ciudades cuyo total de ingresos supera los $500.

In [5]:
%%sql
SELECT Ciudad FROM Ventas
WHERE CantidadVendida * PrecioUnitario > 500
GROUP BY Ciudad;

 * sqlite:///ejemplos.db
Done.

[('Mendoza',), ('San Salvador de Jujuy',), ('Santa Fe',)]

3. Modifique la consulta del inciso 2 para ordenar las Ciudades de mayor a menor ingreso total.

In [6]:
%%sql
SELECT Ciudad, CantidadVendida * PrecioUnitario AS Total_Ingresos FROM Ventas
WHERE Total_Ingresos > 500
GROUP BY Ciudad
ORDER BY Total_Ingresos DESC;

 * sqlite:///ejemplos.db
Done.

[('San Salvador de Jujuy', 780), ('Santa Fe', 770), ('Mendoza', 720)]

## Ejercicio 2: Promedio de Calificaciones por Curso

Considera las siguientes tres tablas:

- La tabla **Estudiantes** contiene información sobre los estudiantes inscritos:
  - `EstudianteID` (INT, PRIMARY KEY)
  - `Nombre` (VARCHAR)

- La tabla **Cursos** contiene información sobre los cursos disponibles:
  - `CursoID` (INT, PRIMARY KEY)
  - `NombreCurso` (VARCHAR)

- La tabla **Calificaciones** registra las notas de los estudiantes en los cursos:
  - `CalificacionID` (INT, PRIMARY KEY)
  - `EstudianteID` (INT, FOREIGN KEY que referencia a `Estudiantes(EstudianteID)`)
  - `CursoID` (INT, FOREIGN KEY que referencia a `Cursos(CursoID)`)
  - `Nota` (DECIMAL)

En este ejercicio, debes analizar el rendimiento de los estudiantes en cada curso, combinando la información de las tres tablas.

In [8]:
%%sql
-- Escribe aquí el código DDL para crear las tablas Estudiantes, Cursos y Calificaciones
CREATE TABLE Estudiantes(
  EstudianteID INT PRIMARY KEY,
  Nombre VARCHAR(100)  -- Especifica una longitud máxima para VARCHAR
);

CREATE TABLE Cursos(
  CursoID INT PRIMARY KEY,
  NombreCurso VARCHAR(100)  -- Especifica una longitud máxima para VARCHAR
);

CREATE TABLE Calificaciones(
  CalificacionID INT PRIMARY KEY,
  EstudianteID INT,
  CursoID INT,
  Nota DECIMAL(5, 2),  -- También se puede especificar la precisión para DECIMAL
  FOREIGN KEY (EstudianteID) REFERENCES Estudiantes(EstudianteID),
  FOREIGN KEY (CursoID) REFERENCES Cursos(CursoID)
);

 * sqlite:///ejemplos.db
Done.
Done.
Done.

[]

**Población de la tabla Calificaciones**

In [9]:
# Insertar datos en la tabla Calificaciones
%%sql
-- Insertar datos en la tabla Estudiantes
INSERT INTO Estudiantes (EstudianteID, Nombre)
VALUES
(1, 'Juan Pérez'),
(2, 'María Gómez'),
(3, 'Carlos Ruiz'),
(4, 'Ana Fernández'),
(5, 'Sofía López'),
(6, 'Lucas Martínez'),
(7, 'Natalia Ríos'),
(8, 'David Torres'),
(9, 'Laura Castro'),
(10, 'Pedro Sánchez'),
(11, 'Valeria Ramírez'),
(12, 'Diego Flores'),
(13, 'Camila Méndez'),
(14, 'Jorge Ortega'),
(15, 'Lucía Vázquez');
-- Insertar datos en la tabla Cursos
INSERT INTO Cursos (CursoID, NombreCurso)
VALUES
(1, 'Matemáticas'),
(2, 'Historia'),
(3, 'Ciencias'),
(4, 'Literatura'),
(5, 'Informática');

-- Insertar datos en la tabla Calificaciones
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota)
VALUES
(1, 1, 1, 8.5),
(2, 1, 2, 7.0),
(3, 2, 1, 9.0),
(4, 2, 3, 6.5),
(5, 3, 4, 8.0),
(6, 4, 5, 9.5),
(7, 5, 1, 7.5),
(8, 5, 2, 8.0),
(9, 5, 3, 9.0),
(10, 5, 4, 8.5),
(11, 6, 1, 6.5),  -- Lucas Martínez en Matemáticas
(12, 6, 2, 7.0),  -- Lucas Martínez en Historia
(13, 7, 3, 9.5),  -- Natalia Ríos en Ciencias
(14, 7, 4, 8.0),  -- Natalia Ríos en Literatura
(15, 8, 1, 5.5),  -- David Torres en Matemáticas
(16, 8, 5, 7.5),  -- David Torres en Informática
(17, 9, 2, 6.0),  -- Laura Castro en Historia
(18, 9, 3, 7.5),  -- Laura Castro en Ciencias
(19, 10, 4, 9.0), -- Pedro Sánchez en Literatura
(20, 10, 5, 8.5), -- Pedro Sánchez en Informática
(21, 11, 1, 7.0), -- Valeria Ramírez en Matemáticas
(22, 11, 2, 8.0), -- Valeria Ramírez en Historia
(23, 12, 3, 6.5), -- Diego Flores en Ciencias
(24, 12, 4, 9.5), -- Diego Flores en Literatura
(25, 13, 5, 8.0), -- Camila Méndez en Informática
(26, 13, 1, 7.5), -- Camila Méndez en Matemáticas
(27, 14, 2, 6.5), -- Jorge Ortega en Historia
(28, 14, 3, 8.5), -- Jorge Ortega en Ciencias
(29, 15, 4, 9.0),
(30, 15, 5, 7.0);

 * sqlite:///ejemplos.db
15 rows affected.
5 rows affected.
30 rows affected.

[]

**Consignas del ejercicio:**

1. Encuentre el promedio de `Nota` para cada `Curso`.

In [10]:
%%sql
SELECT CursoID, AVG(Nota) AS PromedioNota
FROM Calificaciones
GROUP BY CursoID;

 * sqlite:///ejemplos.db
Done.

[(1, 7.357142857142857),
 (2, 7.083333333333333),
 (3, 7.916666666666667),
 (4, 8.666666666666666),
 (5, 8.1)]

2. Escriba el código SQL para listar los cursos con un promedio mayor a 85.

In [11]:
%%sql
SELECT CursoID, AVG(Nota)*10 AS PromedioNota
FROM Calificaciones
GROUP BY CursoID
HAVING PromedioNota > 85;

 * sqlite:///ejemplos.db
Done.

[(4, 86.66666666666666)]


3. Agregue una columna que muestre el número de estudiantes que han tomado cada curso cuyo promedio supera 85, ordenados en forma descendente por promedio.

In [12]:
%%sql
SELECT CursoID, AVG(Nota)*10 AS PromedioNota, COUNT(DISTINCT EstudianteID) AS NumeroEstudiantes
FROM Calificaciones
GROUP BY CursoID
HAVING PromedioNota > 85
ORDER BY PromedioNota DESC;

 * sqlite:///ejemplos.db
Done.

[(4, 86.66666666666666, 6)]

## Ejercicio 3: Conteo de Empleados por Departamento

Tienes dos tablas llamadas `Empleados` y `Departamentos`:

- La tabla `Empleados` tiene las siguientes columnas:
  - `EmpleadoID` (INT)
  - `Nombre` (VARCHAR)
  - `DepartamentoID` (INT, FOREIGN KEY que referencia a `Departamentos(DepartamentoID)`)
  - `Salario` (DECIMAL)

- La tabla `Departamentos` tiene las siguientes columnas:
  - `DepartamentoID` (INT, PRIMARY KEY)
  - `NombreDepartamento` (VARCHAR)

Deseas analizar la distribución de empleados en cada departamento, combinando la información de ambas tablas para mostrar el nombre del departamento y el número de empleados por cada uno.

**Consignas a responder:**

In [13]:
%%sql
-- Escribe aquí el código DDL para crear las tablas Empleados y Departamentos
CREATE TABLE Empleados(
  EmpleadoID INT,
  Nombre VARCHAR(100),
  DepartamentoID INT,
  Salario DECIMAL(10, 2),
  FOREIGN KEY (DepartamentoID) REFERENCES Departamentos(DepartamentoID)
);

CREATE TABLE Departamentos(
  DepartamentoID INT PRIMARY KEY,
  NombreDepartamento VARCHAR(100)
)

 * sqlite:///ejemplos.db
Done.
Done.

[]

**Relleno de las tablas `Empleados` y `Departamentos`**

In [14]:
%%sql
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES
(5, 'Laura', 101, 3100),
(6, 'Javier', 104, 3300),
(7, 'Sofia', 105, 2900),
(8, 'Lucas', 105, 3700),
(9, 'Fernanda', 101, 3200),
(10, 'Diego', 104, 3400),
(11, 'Martina', 103, 4000),
(12, 'Gustavo', 105, 2950),
(13, 'Liliana', 106, 3800),
(14, 'Gabriel', 106, 4100),
(15, 'Natalia', 102, 3600);

INSERT INTO Departamentos (DepartamentoID, NombreDepartamento) VALUES
(101, 'Marketing'),
(102, 'Ventas'),
(103, 'Recursos Humanos'),
(104, 'Desarrollo de Producto'),
(105, 'Investigación de Mercado'),
(106, 'Atención al Cliente');

 * sqlite:///ejemplos.db
11 rows affected.
6 rows affected.

[]

**Consignas del ejercicio:**

1. Encuentre el número total de empleados en cada departamento.

In [17]:
%%sql
SELECT Departamentos.NombreDepartamento, COUNT(Empleados.Nombre) AS NumeroDeEmpleados
FROM Departamentos
INNER JOIN Empleados ON Departamentos.DepartamentoID = Empleados.DepartamentoID
GROUP BY Departamentos.NombreDepartamento
;

 * sqlite:///ejemplos.db
Done.

[('Atención al Cliente', 2),
 ('Desarrollo de Producto', 2),
 ('Investigación de Mercado', 3),
 ('Marketing', 2),
 ('Recursos Humanos', 1),
 ('Ventas', 1)]

2. Escriba el código SQL para listar los departamentos que tienen más de 2 empleados.

In [15]:
%%sql
SELECT NombreDepartamento AS Dptos_Con_Mas_De_Dos_Empleados
FROM Departamentos
INNER JOIN Empleados ON Departamentos.DepartamentoID = Empleados.DepartamentoID
GROUP BY Dptos_Con_Mas_De_Dos_Empleados
HAVING COUNT(Empleados.EmpleadoID) > 2;

 * sqlite:///ejemplos.db
Done.

[('Investigación de Mercado',)]


3. Muestre el salario promedio de los empleados por cada departamento ordenados promedio en forma descendente.

In [16]:
%%sql
SELECT NombreDepartamento, AVG(Salario) AS Salario_Promedio
FROM Departamentos
INNER JOIN Empleados ON Departamentos.DepartamentoID = Empleados.DepartamentoID
GROUP BY NombreDepartamento
ORDER BY Salario_Promedio DESC;

 * sqlite:///ejemplos.db
Done.

[('Recursos Humanos', 4000.0),
 ('Atención al Cliente', 3950.0),
 ('Ventas', 3600.0),
 ('Desarrollo de Producto', 3350.0),
 ('Investigación de Mercado', 3183.3333333333335),
 ('Marketing', 3150.0)]